package Day16;

public class HW16_2 {
}

//что такое парадигма ООП?
//-парадигма ООП, это разделение кода на классы и имитацию реализации реальных вещей для упрощения управления системой
//
//что такое классы в Java?
//-Классы, в джава это реализация реальной вещи в виде кода
//
//что такое свойства класса?
//-Свойства класса, это его атрибуты. Описывающий его характеристики и возможности
//
//
//Как создать экземпляр класса(объект)?
//Student student = new Student();
//
//Как создать свойства для  определенного класса?
//class Student {
//    int age;
//    String name;
//}
//
//Как задать свойство?
//public static void main(String[] args) {
//    Student student = new Student();
//    student.name = "Name";
//    // or
//        student.setName("Name");
//        }
//
//        Как получить определенное свлйство обьекта?
//
//student.getName();
////or
//String s = student.name;
//


